src/test/resources/soap/request/request-unsecure.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
   xmlns:sam="http://wandrell.com/example/ws/entity">
   <soapenv:Header />
   <soapenv:Body>
      <sam:getEntity>
         <id>1</id>
      </sam:getEntity>
   </soapenv:Body>
</soapenv:Envelope>